trade_exp/src/Documents/ОрдерНаОтражениеПересортицыТоваров/ОрдерНаОтражениеПересортицыТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="3cf0d951-577f-431b-87df-61de69f88c89">
  <name>ОрдерНаОтражениеПересортицыТоваров</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="921c4e5a-b673-480f-8655-0bdc23fc2b7e">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="cb8de1d2-2de6-44b6-b392-2b81201c2d3d">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2ef07649-3f8a-405b-9acf-74ce21e2ae44">
    <name>Помещение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a761cd19-f98e-46de-856e-4ebadddfa4ea">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4c06f472-66c2-4e5f-9e60-b71cce9c4769">
    <name>Основание</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e986877c-6eba-4575-b22d-5d3eadc8c4c1">
    <name>РабочийУчасток</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="da9ab023-7c4d-4a16-aa99-407a30b4ae9b">
    <name>ПодтвержденСкладом</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="198f204b-5dc3-4638-b22f-b5a7d2b991be">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="65eb8203-df72-4f83-8d4a-52b27af599e7">
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="44b4a3c6-4e13-47a7-ac12-4257aa90b2fc">
      <name>Ячейка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="ce8dd982-c927-4207-a042-bf5b7a729c43">
      <name>УпаковкаОприходование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="1cdfdf82-c198-4c13-b0e3-699be5ed174e">
      <name>СерияОприходование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="0d947042-9b2e-4325-bae0-a6baf3315a19">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="f40f0dfd-2a6c-4c5f-9613-e6da8c0c072f">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="5182254c-7307-4139-8708-76c24e37239d">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="13c107f4-46f9-43b9-8f42-b624471f9ba9">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="07a89110-9dc2-4bba-bea4-5d991d371460">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="c50c7c88-5d71-4f9d-b5ed-3c9e255716dc">
      <name>НоменклатураОприходование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="8c2aa89c-1deb-4de8-a18a-233bc19c65a6">
      <name>ХарактеристикаОприходование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="454dc59e-25bd-48bf-9776-441cfed41c89">
      <name>НазначениеОприходование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/Enums/ВариантыДействийПоРасхождениямВАктеПослеОтгрузки/ВариантыДействийПоРасхождениямВАктеПослеОтгрузки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ВариантыДействийПоРасхождениямВАктеПослеОтгрузки</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="b4cd5cf2-becc-47fc-acc1-3f5e388de5cc">
    <name>ПокупкаПерепоставленного</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="017e9b68-db4c-46f6-88bb-302b1d077101">
    <name>ДопоставкаНеТребуется</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="0192c7a0-d8f4-421f-84c3-0422e7c325bf">
    <name>ПерепоставленноеДарится</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="47556336-3f8c-4d55-9a13-9637c157cae2">
    <name>ТребуетсяДопоставка</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="7be36844-c452-4b1b-b08c-6918502de0d0">
    <name>ОтгрузитьСейчас</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="f22e447b-d61a-47cc-88c8-6ee796c1e050">
    <name>НедостачаНеПризнана</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="1b2d946d-c9f5-4037-8399-87421b020da2">
    <name>ВозвратПерепоставленного</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="f534a5d7-38e3-40b1-a5a3-1b2ebd98de08">
    <name>ОприходоватьСейчас</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Documents/ОрдерНаОтражениеПересортицыТоваров/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

&После("ОбработкаЗаполнения")
Процедура Док_ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПересортицаТоваров") Тогда
		
		Склад = ДанныеЗаполнения.Склад;
		
		Для каждого Строка из ДанныеЗаполнения.Товары Цикл
			НоваяСтрока = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,Строка);
			НоваяСтрока.КоличествоУпаковок = Строка.Количество;
		КонецЦикла;

			
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.АктОРасхожденияхПослеПеремещения") Тогда
		
		Основание =ДанныеЗаполнения.Ссылка;
		Склад = ДанныеЗаполнения.СкладОтправитель;
		
		Для каждого Строка из ДанныеЗаполнения.Товары Цикл
			//+Альтерра
			Если Строка.Действие = Перечисления.ВариантыДействийПоРасхождениямВАктеПослеОтгрузки.ПокупкаПерепоставленного Тогда
				НоваяСтрока = Товары.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока,Строка,,"Назначение");
				КоличУпаковок = Строка.КоличествоУпаковок - Строка.КоличествоУпаковокПоДокументу;
				МодульКоличУпаковок = Макс(КоличУпаковок, -КоличУпаковок);
				НоваяСтрока.КоличествоУпаковок = МодульКоличУпаковок;
				НоваяСтрока.Количество = МодульКоличУпаковок;
			КонецЕсли;	
			//-
			
			//-Альтерра
			//НоваяСтрока = Товары.Добавить();
			//ЗаполнитьЗначенияСвойств(НоваяСтрока,Строка);
			//НоваяСтрока.КоличествоУпаковок = 0;
			//НоваяСтрока.Количество = 0;
			//-
		КонецЦикла;
		
	КонецЕсли;
КонецПроцедуры

&После("ОбработкаПроведения")
Процедура Док_ОбработкаПроведения(Отказ, РежимПроведения)
		
	//Альтерра
	ДопМодуль.КонтрольОстатков(ЭтотОбъект,Отказ);
    //-Альтерра

КонецПроцедуры

#КонецЕсли
